# CDN-学习笔记
## 骨干网定义

几台计算机连接起来，互相可以看到其他人的文件，这叫局域网，整个城市的计算机都连接起来，就是城域网，把城市之间连接起来的网就叫骨干网。这些骨干网是国家批准的可以直接和国外连接的互联网。其他有接入功能的ISP（互联网服务提供商）想连到国外都得通过这些骨干网。

## 互联网骨干网资料

http://www.enkj.com/idcnews/Article/20150518/7849

## CDN对互联网产业的作用和价值

首先，CDN的发展促进了整个互联网产业的进一步分工。

其次，对于电信运营商，CDN是真正体现管道智能化的技术。CDN利用有效的缓存，均衡和智能路由选择等技术，对互联网信息进行协调组织，形成良好的信息传递保障机制。
CDN的分发和缓存机制，保证了边缘节点临时存储一些热门内容，同时通过相应的调度策略，保证不同节点之间的压力平衡，避免某个路由或节点的压力过大。正是通过这样的缓存和调度策略，才确保整体分发网络的健壮性。

第三，CDN的进一步发展促进了互联网上除运营商和SP之外的第三服务业的蓬勃发展。


## CDN系统架构

典型的CDN系统架构由分发服务系统，负载均衡系统和运营管理系统构成。

